'''
@Description: 配置文件
@Version: 1.0
@Date: 2020-05-02 21:33:05
@LastEditTime: 2020-05-03 15:06:53
'''
# 如果打卡错误，邮件提醒
test = False

# 针对qq邮箱的配置，不要修改
mail_smtp = "smtp.qq.com"
mail_port = 465

# ******** 自定义 *********

mail_from_usr = '12345@qq.com'  #! 从哪个邮箱发出去
mail_from_usr_pw = "dftgyuhgytfrd"  #! 你要知道密码，qq邮箱用的是第三方登录授权码怎么获取，不明白百度

mail_to_usr = '123456788@qq.com'  #管理员邮箱接收错误报告

# 学号，可以为多个人服务，必须是数组，打卡成功发给用户，注意学号和qq对应
usrs = {
    "学号1": "QQ号1",
    "学号2": "QQ号3"
}

# 下面的可以不修改

# 温度范围，实际温度乘以 10，温度随机数范围
temp_zc_ = 356  # 早上最低温度 35.6
temp_zc = 364  # 早上最高温度 36.2

temp_zw_ = 363  # 中午
temp_zw = 367  # 中午

temp_ws_ = 356  # 晚上
temp_ws = 364  # 晚上

# 检查打卡的时间设置
time_hour = '7,8,9, 11,12,13, 19,20,21'  #每天 7：00检查是否打卡了，8：00，9：00……
time_min = '00'
dealy = 60  # 设定时间延迟多久，选择一个0-60的随机数n，延迟n分钟后再打卡

# ******** 自定义 *********

# "6:00-10:00 10:30-14:30 18:30-22:30"
